import 'package:flutter/material.dart';

const kBackgroundColor = Color(0xff1B58B1);
const kSecondTextColor = Color(0xff7B7B7B);
const kConkgroundColor = Color(0xffFFFFFF);

const kMainColor = Color(0xffFF93CE);
const kCardWaitColor = Color(0xffF6B220);
const kCardApproveColor = Color(0xff38CC85);

const List<Map<String, dynamic>> news = [
  {
    'id': 1,
    'pic': 'assets/images/Frame2.png',
    'title': 'ประชาสัมพันธ์',
    'subtitle': 'รางวัลชนะเลิศ เทนนิสประเภทเยาวชนชายเดี่ยว รุ่นอายุไม่เกิน 8 ปี',
    'des':
        'โรงเรียนกรุงเทพคริสเตียนวิทยาลัย ขอแสดงความยินดีกับเด็กชายปัณณพรรธน์ นิ่มนวลกุล นักเรียนชั้น ป.3 รับรางวัลชนะเลิศ ประเภทเยาวชนชายเดี่ยว รุ่นอายุไม่เกิน 8 ปี ศึกเทนนิสเยาวชนเพื่อความชนะเลิศแห่งประเทศไทย ครั้งที่ 58 ประจำปี 2563 ชิงถ้วยพระราชทาน พระบาทสมเด็จพระเจ้าอยู่หัว และ สมเด็จพระกนิษฐาธิราชเจ้า กรมสมเด็จพระเทพรัตนราชสุดา ฯ สยามบรมราชกุมารี ณ ศูนย์พัฒนากีฬาเทนนิสแห่งชาติ เมืองทองธานี เมื่อวันที่ 5 กันยายน 2563'
  },
  {
    'id': 2,
    'pic': 'assets/images/Frame3.png',
    'title': 'ประชาสัมพันธ์',
    'subtitle': 'ขอแสดงความยินดีกับผู้แทนประเทศไทยไปแข่งขันโอลิมปิกวิชาการระหว่างประเทศ ปี 2563',
    'des':
        'ขอแสดงความยินดีกับผู้แทนประเทศไทยไปแข่งขันโอลิมปิกวิชาการระหว่างประเทศ ปี 2563นายกันตวิชญ์ ปิยนิรันดร์ ผู้แทนสาขาชีววิทยาเข้าร่วมการแข่งขัน IBO Challenge 2020ระหว่างวันที่ 10 – 13 สิงหาคม 2563นายธิติพัทธ์ จันทราพิรัตน์ ผู้แทนสาขาฟิสิกส์เข้าร่วมการแข่งขันฟิสิกส์โอลิมปิกระดับทวีปยุโรป European Physics Olympiad 2020 (EuPhO 2020) ระหว่างวันที่ 20 – 26 กรกฎาคม 2563นายวศิน เธียรวุฒิ ผู้แทนสาขาเคมีเข้าร่วมการแข่งขัน IChO 2020 (Remote Access Exam)ระหว่างวันที่ 23 – 29 กรกฎาคม 2563นายพิชญุตม์ แสงรุ่งคงคา ผู้แทนสาขาคณิตศาสตร์เข้าร่วมการแข่งขัน IMO 2020 (Virtual)ระหว่างวันที่ 19 – 28 กันยายน 2563นายณฐนน เทอดไพรสันต์ ผู้แทนสาขาคณิตศาสตร์เข้าร่วมการแข่งขัน IMO 2020 (Virtual)ระหว่างวันที่ 19 – 28 กันยายน 2563'
  },
  {
    'id': 3,
    'pic': 'assets/images/Frame1.png',
    'title': 'ประชาสัมพันธ์',
    'subtitle': 'รางวัลเหรียญทองพร้อมถ้วยรางวัล Chiangmai Ice Hockey Tournament 2020',
    'des':
        'Chiangmai Ice Hockey Tournament 2020เด็กชายสมิต ไทรทอง นักเรียนชั้นมัธยมศึกษาปีที่ 1 โรงเรียนกรุงเทพคริสเตียนวิทยาลัย ได้รับรางวัลเหรียญทอง พร้อมถ้วยรางวัล ประเภททีม รุ่นอายุ 15 ปี จากการแข่งขันฮอกกี้น้ำแข็ง รายการ Chiangmai Ice Hockey Tournament 2020 จัดโดย ZSPORTSGROP ระหว่างวันที่ 5-8 สิงหาคม2563 ณ ลาน Sub-Zero Ice Skate Club สาขาเมกะบางนา'
  }
];

const List<String> contentTitle = ['ทั้งหมด', 'รอดำเนินการ', 'กำลังตรวจสอบ', 'อนุมัติ'];
const List<String> contentDisbur = ['ทั้งหมด', 'รอดำเนินการ', 'กำลังตรวจสอบ', 'อนุมัติ'];

const List<Map<String, dynamic>> projects = [
  {'id': 1, 'projectID': '25681010123', 'status': 'รอดำเนินการ', 'startDate': '10/10/2068', 'endDate': '10/10/2569', 'budget': '10,000,000.00'},
  {'id': 2, 'projectID': '25681010123', 'status': 'กำลังตรวจสอบ', 'startDate': '10/10/2068', 'endDate': '10/10/2569', 'budget': '10,000,000.00'},
  {'id': 3, 'projectID': '25681010123', 'status': 'อนุมัติ', 'startDate': '10/10/2068', 'endDate': '10/10/2569', 'budget': '10,000,000.00'},
  {'id': 4, 'projectID': '25681010123', 'status': 'อนุมัติ', 'startDate': '10/10/2068', 'endDate': '10/10/2569', 'budget': '10,000,000.00'},
  {'id': 5, 'projectID': '25681010123', 'status': 'อนุมัติ', 'startDate': '10/10/2068', 'endDate': '10/10/2569', 'budget': '10,000,000.00'}
];

const List<Map<String, dynamic>> disbursement = [
  {'id': 1, 'numPro': '2233-4455-6677', 'status': 'รออนุมัติ', 'cotton': 'ภาษาไทย', 'totalPrice': '14,100 บาท', 'createList': '10/12/2567', 'edit': '10/12/2567'},
  {'id': 2, 'numPro': '2233-4455-6677', 'status': 'กำลังดำเนินการ', 'cotton': 'ภาษาไทย', 'totalPrice': '14,100 บาท', 'createList': '10/12/2567', 'edit': '10/12/2567'},
  {'id': 3, 'numPro': '2233-4455-6677', 'status': 'เสร็จสิ้น', 'cotton': 'ภาษาไทย', 'totalPrice': '14,100 บาท', 'createList': '10/12/2567', 'edit': '10/12/2567'}
];
